//===========================================================================
//文件名称：light.c
//功能概要：小灯构件源文件
//版权所有：苏州大学飞思卡尔嵌入式中心(sumcu.suda.edu.cn)
//更新记录：2012-10-09   V1.0     初始版本
//===========================================================================

#include "light.h"   

//============================================================================
//函数名称：light_init
//函数参数：port：端口名。由宏定义。
//          pin:：引脚号。由宏定义。
//          state：设定小灯状态。由宏定义。
//函数返回：无
//功能概要：指示灯驱动初始化。
//============================================================================
void light_init(uint_8 port, uint_8 pin, uint_8 state)
{
    gpio_init(port, pin, 1, state);
}

//============================================================================
//函数名称：light_control
//函数参数：port：端口名。由宏定义。
//          pin:：引脚号。由宏定义。
//          state：设定小灯状态。由宏定义。
//函数返回：无
//功能概要：控制指示灯亮暗。
//============================================================================
void light_control(uint_8 port, uint_8 pin, uint_8 state)
{
    gpio_set(port, pin, state);
}

//============================================================================
//函数名称：light_change
//函数参数：port：端口名。由宏定义。
//          pin:：引脚号。由宏定义。
//函数返回：无
//功能概要：切换指示灯亮暗。
//============================================================================
void light_change(uint_8 port, uint_8 pin)
{
    gpio_reverse(port, pin);
}
