
//============================================================================
// 文件名称：kb.h
// 功能概要：键盘构件头文件
// 版权所有: 苏州大学飞思卡尔嵌入式中心(sumcu.suda.edu.cn)
// 版本更新:     时间                     版本                                       修改
//           2012-11-17     V1.0       编写了KL25的键盘驱动
//============================================================================

#ifndef __KB_H__
#define __KB_H__

#ifdef __cplusplus
extern "C" {
#endif

#include "include.h"
#include "gpio.h"

//芯片端口名定义
//PORTC口为KB数据口
#define KBPort  PORTC

//============================================================================
//函数名称：KBInit
//函数返回：无
//参数说明：无
//功能概要：初始化键盘模块。
//============================================================================
extern void KBInit(void);

//============================================================================
//函数名称：KBDef
//函数返回：无
//参数说明：键值valve
//功能概要：键值转为定义值函数。
//============================================================================
extern uint_8 KBDef(uint_8 valve);

//============================================================================
//函数名称：KBScanN
//函数返回：多次扫描键盘得到的键值
//参数说明：重复扫描键盘的的次数(KB_count)
//功能概要：多次扫描键盘，消除"抖动"。
//============================================================================
extern uint_8 KBScanN(uint_8 KB_count);

//============================================================================
//函数名称：KBScan1
//函数返回：扫描到的键值
//参数说明：键值valve
//功能概要：扫描1次4*4键盘,返回扫描到的键值,若无按键,返回0x00 。
//============================================================================
extern uint_8 KBScan1(void);

#ifdef __cplusplus
}
#endif


#endif /* __KB_H__ */
