//============================================================================
// 文件名称：led.h
// 功能概要：LED构件头文件
// 版权所有: 苏州大学飞思卡尔嵌入式中心(sumcu.suda.edu.cn)
// 版本更新:     时间                     版本                                       修改
//           2012-12-01     V1.0       编写了KL25的LED驱动
//============================================================================

#ifndef __LED_H__
#define __LED_H__


#include "common.h"
#include "gpio.h"

//
#define LedData  PORTB    //TC口为LED数据口分别接PTB的{11,10,9,8,3,2,1,0}脚
#define LedCS    PORTB   //TC口为LED位选口分别接PTB的{19,18,17,16}脚


//============================================================================
//函数名称：LEDInit
//函数返回：无
//参数说明：无
//功能概要：LED初始化。
//============================================================================
void LEDInit();

//============================================================================
//函数名称：LEDshow1
//函数返回：无
//参数说明：i:指定LCD哪一位显示，c:显示的内容
//功能概要：指定LCD第i位显示c。
//============================================================================
void LEDshow1(uint_8 i, uint_8 c);

//============================================================================
//函数名称：LEDchangeCode
//函数返回：将num对应的Dtable里面的码取出
//参数说明：  num：需要显示的数在Dtable里面的序号
//功能概要：将num转换成对应的Dtable中的码
//============================================================================
uint_8 LEDchangeCode(uint_8 num);


#endif /* __LED_H__ */
