//============================================================================
// 文件名称：lcd.h
// 功能概要：lcd构件头文件
// 版权所有: 苏州大学飞思卡尔嵌入式中心(sumcu.suda.edu.cn)
// 版本更新:     时间                     版本                                       修改
//           2012-11-17     V1.0       编写了KL25的lcd驱动
//============================================================================

#ifndef __LCD_H__
#define __LCD_H__

#ifdef __cplusplus
extern "C" {
#endif


#include "common.h"
#include "gpio.h"

#define LcdControl    PORTD    //TE口为LCD位选口
#define LCDRS       7         //LCD寄存器选择信号控制端口的7脚
#define LCDRW       6         //LCD读写信号接控制端口的6脚
#define LCDE        5         //LCD读写信号接控制端口的5脚


//============================================================================
//函数名称：LCDInit
//函数返回：无
//参数说明：无
//功能概要：LCD初始化。
//============================================================================
extern void LCDInit();
//============================================================================
//函数名称：LCDShow
//函数返回：无
//参数说明：data[32]：需要显示的数组
//功能概要：LCD显示数组的内容。
//============================================================================
extern void LCDShow(uint_8 data[32]);

#ifdef __cplusplus
}
#endif

#endif /* __LCD_H__ */
