//============================================================================
//文件名称：light.h
//功能概要：小灯构件头文件
//版权所有：苏州大学飞思卡尔嵌入式中心(sumcu.suda.edu.cn)
//更新记录：2012-10-09   V1.0     初始版本
//============================================================================

#ifndef __LIGHT_H_
#define __LIGHT_H_

//头文件包含
#include "common.h"    //包含公共代码
#include "gpio.h"      //用到gpio构件

//指示灯端口及引脚定义
#define LIGHT_PORT       GPIO_PORT_E   //指示灯使用的端口
#define LIGHT_PIN_1      GPIO_PIN(20)  //指示灯使用的引脚  
#define LIGHT_PIN_2      GPIO_PIN(21)         
#define LIGHT_PIN_3      GPIO_PIN(22)
#define LIGHT_PIN_4      GPIO_PIN(23)



//灯状态宏定义（灯亮、灯暗对应的物理电平由硬件接法决定）
#define LIGHT_ON        GPIO_LEVEL_LOW         //灯亮
#define LIGHT_OFF       GPIO_LEVEL_HIGH        //灯暗

//=================接口函数声明===============================================
//============================================================================
//函数名称：light_init
//函数参数：port：端口名。由宏定义。
//          pin：引脚号。由宏定义。
//          state：设定小灯状态。由宏定义。
//函数返回：无
//功能概要：指示灯驱动初始化。
//============================================================================
void light_init(uint_8 port, uint_8 pin, uint_8 state);

//============================================================================
//函数名称：light_control
//函数参数：port：端口名。由宏定义。
//          pin：引脚号。由宏定义。
//          state：设定小灯状态。由宏定义。
//函数返回：无
//功能概要：控制指示灯亮暗。
//============================================================================
void light_control(uint_8 port, uint_8 pin, uint_8 state);

//============================================================================
//函数名称：light_change
//函数参数：port：端口名。由宏定义。
//          pin:：引脚号。由宏定义。
//函数返回：无
//功能概要：切换指示灯亮暗。
//============================================================================
void light_change(uint_8 port, uint_8 pin);

#endif
