/******************** (C) COPYRIGHT 2011 野火嵌入式开发工作室 ********************
 * 文件名       ：main.c
 * 描述         ：工程模版实验
 *
 * 实验平台     ：野火kinetis开发板
 * 库版本       ：
 * 嵌入系统     ：
 *
 * 作者         ：野火嵌入式开发工作室
 * 淘宝店       ：http://firestm32.taobao.com
 * 技术支持论坛 ：http://www.ourdev.cn/bbs/bbs_list.jsp?bbs_id=1008
**********************************************************************************/

#include "include.h"


/*************************************************************************
*                             野火嵌入式开发工作室
*                               野火工程模版
*  实验说明：野火工程模版
*
*  实验操作：
*
*  实验效果：
*
*  实验目的：
*
*  修改时间：
*
*  备    注：
*************************************************************************/
void main()
{
    //自行添加代码
    LED_INIT();
    while(1)
    {
        water_lights();
    }
}